In [1]:
# Packages
import pyodbc

# Connecting to SQL SERVER

In [3]:
connect = pyodbc.connect(driver='{SQL Server}', host=server, database=db1, trusted_connection=tcon, user=uname, password=pword)

In [4]:
cursor = connect.cursor()

# Instructions

Part 1: Creating a database
Save all of your instructions in a script file - you will submit this file on Gnomio and github.

**Create a database called “Umuzi”.**

SQL Command:
    CREATE DATABASE UMUZI;

![title](Capture.png)

**Create the following tables in the Umuzi database:**
    
      Customers 
      Employees 
      Orders 
      Payments 
      Products

## Creating Tables

In [5]:
# Customers
sql_commandA = """ 
CREATE TABLE Customers(
        customerid      INT NOT NULL IDENTITY(1,1),
        firstname       VARCHAR (50),
        lastname        VARCHAR(50),
        gender          VARCHAR(50),
        addresses       VARCHAR(200),
        phone           BIGINT,
        email           VARCHAR(100),
        city            VARCHAR(20),
        country         VARCHAR(50),
        PRIMARY KEY (customerid )
);
"""

In [6]:
cursor.execute(sql_commandA)
connect.commit()

In [7]:
# Employees
sql_commandB = """ 
CREATE TABLE Employees(
        employeeid     INT NOT NULL IDENTITY(1,1),
        firstname      VARCHAR(50),
        lastname       VARCHAR(50),
        email          VARCHAR(100),
        jobTitle       VARCHAR(50),
        PRIMARY KEY (employeeid)
);
"""

In [8]:
cursor.execute(sql_commandB)
connect.commit()

In [9]:
# Payments
sql_commandC = """ 
CREATE TABLE Payments(
        paymentId      INT NOT NULL IDENTITY(1,1),
        customerId     INT,
        paymentDate    DATE,
        amount         FLOAT,
        PRIMARY KEY (paymentId),
        FOREIGN KEY (customerId) REFERENCES Customers(customerId)

);"""

In [10]:
cursor.execute(sql_commandC)
connect.commit()

In [11]:
# Products
sql_commandD = """
CREATE TABLE Products(
        productId     INT NOT NULL IDENTITY(1,1),
        productName   VARCHAR (50),
        descriptions  VARCHAR(500),
        buyPrice      FLOAT,
        PRIMARY KEY (productId)
);
"""

In [12]:
cursor.execute(sql_commandD)
connect.commit()

In [13]:
# Orders
sql_commandE = """
CREATE TABLE Orders(
        orderId           INT NOT NULL IDENTITY(1,1),        
        productId         INT,
        paymentId         INT,      
        employeeId        INT,      
        dateRequired      DATE,
        dateShipped       DATE,
        parcelStatus      VARCHAR(100),
        PRIMARY KEY (orderId),
        FOREIGN KEY (productId) REFERENCES Products(productId),
        FOREIGN KEY (paymentId) REFERENCES Payments(paymentId),
        FOREIGN KEY (employeeId) REFERENCES Employees(employeeId)
);
"""

In [14]:
cursor.execute(sql_commandE)
connect.commit()

# Inserting the records into tables

In [15]:
# Customers
sql_commandF = """
INSERT INTO Customers(firstname,lastname,gender,addresses,phone,email,city,country)
                  VALUES('John','Hibert','Male','284 chaucer st',+2784789657,'john@gmail.com','Johannesburg','South'),
                        ('Thando','Sithole','Female','240 Sect 1',+27794445584,'thando@gmail.com','Cape Town','South Africa'),
                        ('Leon','Glen','Male','81 Everton Rd,Gillits',+27820832830,'Leon@gmail.com','Durban','South Africa'),
                        ('Charl','Muller','Mal','290A Dorset Ecke',+44856872553,'Charl.muller@yahoo.com','Berlin','Germany'),
                        ('Julia','Stein','Female','2 Wernerring',+448672445058,'Js234@yahoo.com','Frankfurt','Germany');
"""

In [16]:
cursor.execute(sql_commandF)
connect.commit()

In [17]:
# View the Customers Table in SQL
cursor.execute("SELECT * FROM Customers")
cursor.fetchall()

[(1, 'John', 'Hibert', 'Male', '284 chaucer st', 2784789657, 'john@gmail.com', 'Johannesburg', 'South'),
 (2, 'Thando', 'Sithole', 'Female', '240 Sect 1', 27794445584, 'thando@gmail.com', 'Cape Town', 'South Africa'),
 (3, 'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', 27820832830, 'Leon@gmail.com', 'Durban', 'South Africa'),
 (4, 'Charl', 'Muller', 'Mal', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany'),
 (5, 'Julia', 'Stein', 'Female', '2 Wernerring', 448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany')]

In [18]:
# Employess
sql_commandG = """
INSERT INTO Employees(firstname,lastname,email,jobtitle)
            VALUES('Kani','Matthew','mat@gmail.com','Manager'),
                  ('Lesly','Cronje','LesC@gmail.com','Clerk'),
                  ('Gideon','Maduku','m@gmail.com','Accountant');
"""

In [19]:
cursor.execute(sql_commandG)
connect.commit()

In [20]:
# View the Employees Table in SQL
cursor.execute("SELECT * FROM Employees")
cursor.fetchall()

[(1, 'Kani', 'Matthew', 'mat@gmail.com', 'Manager'),
 (2, 'Lesly', 'Cronje', 'LesC@gmail.com', 'Clerk'),
 (3, 'Gideon', 'Maduku', 'm@gmail.com', 'Accountant')]

In [21]:
# Payments
sql_commandH = """
INSERT INTO Payments(paymentDate,amount)
            VALUES('01-09-2018',150.75),
                  ('03-09-2018',150.75),
                  ('03-09-2018',700.60);
"""

In [22]:
cursor.execute(sql_commandH)
connect.commit()

In [23]:
# View the Payments Table in SQL
cursor.execute("SELECT * FROM Payments")
cursor.fetchall()

[(1, None, '2018-01-09', 150.75),
 (2, None, '2018-03-09', 150.75),
 (3, None, '2018-03-09', 700.6)]

In [24]:
# Products
sql_commandI = """
INSERT INTO Products(productName,descriptions,buyPrice)
            VALUES('Harley Davidson Chopper','This replica features working kickstand, front suspension, gear-shift lever',150.75),
                  ('Classic Car','Turnable front wheels, steering function',550.75),
                  ('Sports car','Turnable front wheels, steering function',700.60);
"""

In [25]:
cursor.execute(sql_commandI)
connect.commit()

In [26]:
# View the above created Table in SQL
cursor.execute("SELECT * FROM Products")
cursor.fetchall()

[(1, 'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75),
 (2, 'Classic Car', 'Turnable front wheels, steering function', 550.75),
 (3, 'Sports car', 'Turnable front wheels, steering function', 700.6)]

In [27]:
# Orders
sql_commandJ = """
INSERT INTO Orders(dateRequired,dateShipped,parcelStatus)
            VALUES('05-09-2018',NULL,'Not shipped'),
                  ('04-09-2018','03-09-2018','Shipped'),
                  ('06-09-2018',NULL,'Not shipped');
"""

In [28]:
cursor.execute(sql_commandJ)
connect.commit()

In [29]:
# View the above created Table in SQL
cursor.execute("SELECT * FROM Orders")
cursor.fetchall()

[(1, None, None, None, '2018-05-09', None, 'Not shipped'),
 (2, None, None, None, '2018-04-09', '2018-03-09', 'Shipped'),
 (3, None, None, None, '2018-06-09', None, 'Not shipped')]

# Part 2: Querying a database
    
Save all of your instructions in a script file - you will submit this file on Gnomio and github

**SELECT ALL records from table Customers.**

In [30]:
cursor.execute("SELECT * FROM Customers;")
cursor.fetchall()

[(1, 'John', 'Hibert', 'Male', '284 chaucer st', 2784789657, 'john@gmail.com', 'Johannesburg', 'South'),
 (2, 'Thando', 'Sithole', 'Female', '240 Sect 1', 27794445584, 'thando@gmail.com', 'Cape Town', 'South Africa'),
 (3, 'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', 27820832830, 'Leon@gmail.com', 'Durban', 'South Africa'),
 (4, 'Charl', 'Muller', 'Mal', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany'),
 (5, 'Julia', 'Stein', 'Female', '2 Wernerring', 448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany')]

**SELECT records only from the name column in the Customers table.**

In [31]:
cursor.execute("SELECT firstname FROM Customers;")
cursor.fetchall()

[('John', ), ('Thando', ), ('Leon', ), ('Charl', ), ('Julia', )]

**Show the name of the Customer whose CustomerID is 1.**

In [32]:
cursor.execute("SELECT firstname FROM Customers WHERE CustomerID = 1;")
cursor.fetchall()

[('John', )]

**UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.**

In [33]:
cursor.execute("UPDATE Customers SET firstname = 'Lerato', lastname= 'Mabitso' WHERE customerID = 1;")

**DELETE the record from the Customers table for customer 2 (CustomerID = 2).**

In [34]:
cursor.execute("DELETE FROM Customers WHERE customerid= 2;")
cursor.commit()
cursor.execute("SELECT firstname FROM Customers;")
cursor.fetchall()

[('Lerato', ), ('Leon', ), ('Charl', ), ('Julia', )]

**Select all unique statuses from the Orders table and get a count of the number of orders for each unique status.**

In [35]:
cursor.execute("SELECT COUNT(DISTINCT parcelStatus) FROM Orders;")
cursor.fetchall()

[(2, )]

**Return the MAXIMUM payment made on the PAYMENTS table**

In [36]:
cursor.execute("SELECT MAX(amount) FROM payments;")
cursor.fetchall()

[(700.6, )]

**Select all customers from the “Customers” table, sorted by the “Country” column.**

In [37]:
cursor.execute("SELECT * FROM Customers ORDER BY country;")
cursor.fetchall()

[(4, 'Charl', 'Muller', 'Mal', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany'),
 (5, 'Julia', 'Stein', 'Female', '2 Wernerring', 448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany'),
 (1, 'Lerato', 'Mabitso', 'Male', '284 chaucer st', 2784789657, 'john@gmail.com', 'Johannesburg', 'South'),
 (3, 'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', 27820832830, 'Leon@gmail.com', 'Durban', 'South Africa')]

**Select all customers from the “Customers” table, sorted by the “Country” column.**

In [38]:
cursor.execute("SELECT * FROM Customers ORDER BY country;")
cursor.fetchall()

[(4, 'Charl', 'Muller', 'Mal', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany'),
 (5, 'Julia', 'Stein', 'Female', '2 Wernerring', 448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany'),
 (1, 'Lerato', 'Mabitso', 'Male', '284 chaucer st', 2784789657, 'john@gmail.com', 'Johannesburg', 'South'),
 (3, 'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', 27820832830, 'Leon@gmail.com', 'Durban', 'South Africa')]

**Select all products with a price BETWEEN R100 and R600**

In [39]:
cursor.execute("SELECT * FROM Products WHERE buyPrice BETWEEN 100 AND 600;")
cursor.fetchall()

[(1, 'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75),
 (2, 'Classic Car', 'Turnable front wheels, steering function', 550.75)]

**Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.**

In [40]:
cursor.execute("SELECT * FROM Customers WHERE country = 'Germany' AND city = 'Berlin';")
cursor.fetchall()

[(4, 'Charl', 'Muller', 'Mal', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany')]

**Select all fields from “Customers” where city is “Cape Town” OR “Durban”.**

In [41]:
cursor.execute("SELECT * FROM Customers WHERE city = 'Cape Town' OR city = 'Durban';")
cursor.fetchall()

[(3, 'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', 27820832830, 'Leon@gmail.com', 'Durban', 'South Africa')]

**Select all records from Products where the Price is GREATER than R500.**

In [42]:
cursor.execute("SELECT * FROM Products WHERE buyprice > 500;")
cursor.fetchall()

[(2, 'Classic Car', 'Turnable front wheels, steering function', 550.75),
 (3, 'Sports car', 'Turnable front wheels, steering function', 700.6)]

**Return the sum of the Amounts on the Payments table.**

In [43]:
cursor.execute("SELECT SUM(amount) FROM payments;")
cursor.fetchall()

[(1002.1, )]

**Count the number of shipped orders in the Orders table.**

In [44]:
cursor.execute("SELECT COUNT(parcelStatus) FROM Orders WHERE parcelStatus = 'Shipped';")
cursor.fetchall()

[(1, )]

**Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).**

In [45]:
cursor.execute("SELECT AVG(buyprice) AS Rands, AVG(buyprice) / 12 AS Dollars FROM Products;")
cursor.fetchall()

[(467.3666666666666, 38.947222222222216)]

**Using INNER JOIN create a query that selects all Payments with Customer information.**

In [46]:
cursor.execute("SELECT * FROM Payments INNER JOIN Customers ON Payments.customerid = Customers.customerid;")
cursor.commit()

**Select all products that have turnable front wheels.**

In [47]:
cursor.execute("SELECT * FROM Products WHERE descriptions LIKE 'Turnable front wheels%';")
cursor.fetchall()

[(2, 'Classic Car', 'Turnable front wheels, steering function', 550.75),
 (3, 'Sports car', 'Turnable front wheels, steering function', 700.6)]

### Queries Complete closing SQL Connection

In [48]:
connect.close()